RhinoInside.Revit API Documentation
ColorWithTransparencyConverter Class
 Represents a converter for converting Color values with transparency back and forth Revit and Rhino.
Inheritance Hierarchy
System.Object
 RhinoInside.Revit.Convert.System.Drawing.ColorWithTransparencyConverter
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8018
Syntax
public static class ColorWithTransparencyConverter
The ColorWithTransparencyConverter type exposes the following members.
Methods
Name | Description
ToColor
 Converts the specified Autodesk.Revit.DB.ColorWithTransparency to an equivalent Color.
ToColorWithTransparency
 Converts the specified Color to an equivalent Autodesk.Revit.DB.Color.
Top
See Also
Reference
RhinoInside.Revit.Convert.System.Drawing Namespace